verilog_defaults -push
verilog_defaults -add -defer
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/Proyectos/Circuitos/Repositorio/SoC_Display/module/ram/ram.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/Proyectos/Circuitos/Repositorio/SoC_Display/module/led_control.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_cpu.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_instruction_unit.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_decoder.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_load_store_unit.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_adder.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_addsub.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_logic_op.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_shifter.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_multiplier.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_mc_arithmetic.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_interrupt.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_ram.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dp_ram.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_icache.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dcache.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_debug.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_itlb.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl/lm32_dtlb.v
read_verilog -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/pythondata-cpu-lm32/pythondata_cpu_lm32/verilog/rtl -I/home/esteban/DiscoDuro2/Unal/Digitales_2/litex/litex/litex/soc/cores/cpu/lm32/verilog/config /home/esteban/DiscoDuro2/Unal/Digitales_2/Proyectos/Circuitos/Repositorio/SoC_Display/build/gateware/tarjeta_luis.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top tarjeta_luis
write_json  tarjeta_luis.json